#Python 출력

""" <--- 여러줄을 주석

프로그래밍은 자료와 처리라는 두가지 표현으로 말할 수 있어요

[자료형] : 문자, 숫자, 불(참과 거짓 -> True, False)
동적 : 자료형을 지정하지 않고도 자료를 저장할 수 있어요
정적 : 자료형을 지정해야만 자료를 저장할 수 있어요
String(문자열) : 문자로 이루어진 자료형 Str = 외워야한다.

Number(숫자) : 숫자로 이루어진 자료형 Int = 정수, Float = 실수
- 1234, 556, 3451345
Boolean(불) : 참과 거짓으로 이루어진 자료형 Bool = True, False -> 1, 0

함수 :  내가 만들고 싶은 기능을 정의해서 언제든 불러서 쓸 수 있게 만든것
괄호를 열고 닫는 형태 -> 함수를 구분할 수 있는 특징중에 하나
"""

# print(3,end='')
# print(3)

#sep = seperator
print("안녕하세요","즐거워요"," 방가워요", sep='-')
# 핸드폰번호, 주민등록번호
print("010","1234","5678", sep='-')

